{
  "backend/main.mo": "Main canister implementing user profiles, visitor records, admin password controls, and access‑controlled CRUD operations.",
  "backend/migration.mo": "Migration module preserving stable state, updating adminPassword when needed during upgrades.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten textual summaries of all frontend files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme tokens for light and dark modes.",
  "frontend/index.html": "Root HTML page loading the React app via main.tsx.",
  "frontend/src/App.tsx": "App root wiring React Query, theming, and rendering VisitorTracker with toast support.",
  "frontend/src/components/AdminLogin.tsx": "Dialog for verifying admin password with validation, error handling, and async unlock flow.",
  "frontend/src/components/ChangeAdminPasswordDialog.tsx": "Dialog for updating the admin password with client-side validation and status handling.",
  "frontend/src/components/VisitorForm.tsx": "Form for submitting new visitor records with validation and mutation to backend.",
  "frontend/src/components/VisitorTable.tsx": "Displays visitor records in a table with editing via a dialog and updates handled through a mutation.",
  "frontend/src/components/VisitorTracker.tsx": "Combines visitor form, table, admin login, and export features with admin-gated actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on changes.",
  "frontend/src/hooks/useAdminMode.ts": "Manages admin unlock state using backend verification and session storage with lock/unlock handlers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and handles login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on visitor records and admin password changes.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the app with QueryClient and Internet Identity providers.",
  "frontend/src/utils/exportToCSV.ts": "Converts visitor records into CSV format and triggers a file download.",
  "frontend/src/utils/exportToXLSX.ts": "Dynamically loads SheetJS to convert visitor records into a formatted XLSX workbook with set column widths and triggers a file download.",
  "frontend/src/utils/formatTimestamp.ts": "Converts a bigint nanosecond timestamp to a human‑readable date string using US locale formatting.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them in sessionStorage, and handling hash‑based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, features, requirements, known issues, and architectural notes for the visitor tracking tool."
}