{
  "backend/main.mo": "Main Motoko actor implementing access-controlled user profiles and visitor record CRUD operations with sorting and export support.",
  "backend/migration.mo": "Defines migration types and a simple pass-through migration function for upgrading stored user profiles and visitor records.",
  "feature_evidence.json": "Feature evidence report linking specific frontend files and components to the requirement ensuring admin views use server-stored visitor data.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or reference.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Minimal HTML entry point containing the root element and script loader for the React application.",
  "frontend/src/App.tsx": "Root React component setting up theming, query client, and rendering the VisitorTracker with toast notifications.",
  "frontend/src/components/AdminLogin.tsx": "Dialog component handling admin password submission with validation, errors, and controlled visibility.",
  "frontend/src/components/VisitorForm.tsx": "Form component for creating visitor records with validation and submission via addVisitorRecord mutation.",
  "frontend/src/components/VisitorTable.tsx": "Table component displaying visitor records with optional admin editing and update logic driven by mutations.",
  "frontend/src/components/VisitorTracker.tsx": "Main visitor tracker UI component handling admin mode, record fetching, and CSV/XLSX export actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminMode.ts": "Provides simple admin mode state with session persistence and password-based unlock/lock functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, exposing identity state and login/logout handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching, adding, updating, and exporting visitor records through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables and global light/dark theme styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, and React Query client.",
  "frontend/src/utils/exportToCSV.ts": "Converts visitor records to CSV format, escapes values, and triggers a file download.",
  "frontend/src/utils/exportToXLSX.ts": "Dynamically loads SheetJS to generate an Excel file from visitor records with formatted columns.",
  "frontend/src/utils/formatTimestamp.ts": "Formats bigint timestamps into human-readable date strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them, supporting mixed routing setups.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for a themed UI including container queries and animations.",
  "project_state.json": "Describes the project’s shared visitor‑tracking tool, its admin rules, architecture notes, and the list of implemented features with versions."
}