{
  "backend/main.mo": "Canister implementing visitor record storage, user profiles, access control, timestamped entries, admin login via password 9533, and sorted record retrieval.",
  "feature_evidence.json": "Feature evidence report mapping implemented requirements to frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based theme file defining OKLCH color tokens and light/dark mode variables for the UI.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component providing theme and React Query providers and rendering the VisitorTracker UI.",
  "frontend/src/components/AdminLogin.tsx": "Admin password dialog handling authentication via backend mutation and enabling admin mode on success.",
  "frontend/src/components/VisitorForm.tsx": "Form component using react-hook-form to submit validated visitor details to the backend and reset after submission.",
  "frontend/src/components/VisitorTable.tsx": "Scrollable table displaying visitor records with formatted timestamps, badges, and loading or empty states.",
  "frontend/src/components/VisitorTracker.tsx": "Main visitor tracking UI with admin login, visitor form, table display, and CSV/XLSX export actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAdminMode.ts": "Tracks admin mode using sessionStorage with simple login/logout toggles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching, adding, exporting visitor records and performing admin login via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers.",
  "frontend/src/utils/exportToCSV.ts": "Generates and downloads a CSV file from visitor records with escaped values.",
  "frontend/src/utils/exportToXLSX.ts": "Dynamically imports SheetJS to generate and download an XLSX file of visitor records.",
  "frontend/src/utils/formatTimestamp.ts": "Formats bigint timestamps into human‑readable date strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS config defining dark mode, content paths, extended theme colors, typography, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing visitor-tracking app features, admin password flow, known issues, and pending feature requests."
}