{
  "kind": "build_request",
  "title": "Change Admin unlock password to 9533",
  "projectName": "MONEY SOLUTION POINT",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Update the backend Admin unlock password so that Admin unlock succeeds only when the provided password exactly equals \"9533\" (replacing the current default \"MSP9533\").",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "PASWWORD CHANGE TO 9533"
        ]
      },
      "acceptanceCriteria": [
        "In backend/main.mo, the default admin password value is \"9533\" (not \"MSP9533\").",
        "Calling unlockAdminPrivileges(\"9533\") returns true for an authenticated user and grants Admin privileges.",
        "Calling unlockAdminPrivileges(\"MSP9533\") returns false (unless the Admin password was previously changed and persisted to that value)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Ensure canister upgrades preserve the existing persisted Admin password; only initialize the Admin password to \"9533\" when no previously-stored Admin password exists in stable state during migration/upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "PASWWORD CHANGE TO 9533"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade, if a deployment previously had a stored Admin password, that stored value remains unchanged.",
        "After an upgrade from a deployment with no stored Admin password, the Admin password is initialized to exactly \"9533\"."
      ]
    }
  ],
  "constraints": [
    "All user-facing text must be in English.",
    "Respect the single-actor backend architecture; keep Motoko logic in backend/main.mo.",
    "Do not edit frontend files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change visitor record fields, storage, export formats, or Admin-only gating behavior beyond updating the Admin password value.",
    "Do not address the known issue about records not showing after Admin unlock unless it is directly required to complete the password change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}